<template>
    <div class="com-8">
        <v-row>
            <v-col cols="6" v-for="(item, i) of cols" :key="i">
                <p v-html="item.text"></p>
            </v-col>
        </v-row>
    </div>
</template>

<script>
    export default {
        name: "TwoColumnText",
        data: () => ({
            cols: [
                {text: '<p>В рамках спецификации современных стандартов, непосредственные участники технического прогресса формируют глобальную экономическую сеть и при этом - ограничены исключительно образом мышления.</p>' +
                        '<p>Базовый вектор развития создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса инновационных методов управления процессами.</p>' +
                        '<p>Сплочённость команды профессионалов обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями.</p>' +
                        '<p>В своём стремлении повысить качество жизни, они забывают, что постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании экспериментов, поражающих по своей масштабности и грандиозности.</p>'},
                {text: '<p>В рамках спецификации современных стандартов, непосредственные участники технического прогресса формируют глобальную экономическую сеть и при этом - ограничены исключительно образом мышления.</p>' +
                        '<p>Базовый вектор развития создаёт необходимость включения в производственный план целого ряда внеочередных мероприятий с учётом комплекса инновационных методов управления процессами.</p>' +
                        '<p>Сплочённость команды профессионалов обеспечивает широкому кругу (специалистов) участие в формировании приоритизации разума над эмоциями.</p>' +
                        '<p>В своём стремлении повысить качество жизни, они забывают, что постоянное информационно-пропагандистское обеспечение нашей деятельности играет важную роль в формировании экспериментов, поражающих по своей масштабности и грандиозности.</p>'}
            ]
        })
    }
</script>

<style scoped>
    .com-8 {
        padding-top: 150px;
    }

    p {
        max-width: 480px;
        margin: 0 auto;

        font-style: normal;
        font-weight: normal;
        font-size: 16px;
        line-height: 140%;
        color: #2B2A29;
    }
</style>
